
INSERT INTO public.product 
(prd_name, prd_price, prd_quantity, prd_category) VALUES
('Манго', 100.00, 50, 'Фрукты'),
('Дуриан', 350.00, 40, 'Фрукты'),
('Лонган', 90.00, 50, 'Фрукты'),
('Папайя', 50.00, 50, 'Фрукты'),
('Личи', 90.00, 50, 'Фрукты'),
('Джекфрут', 95.00, 50, 'Фрукты'),
('Картофель', 100.00, 50, 'Овощи');

INSERT INTO public.customer
(cst_firstname, cst_lastname, cst_phone, cst_email) values
('Иван', 'Петров', '911-387-8766', 'ipetrov@mail.ru'),
('Петр', 'Васечкин', '921-990-6730', 'vas@mail.ru'),
('Елена', 'Козлова', '991-439-2341', 'ekoz@mail.ru'),
('Юлия', 'Зайцева', '911-564-1008', ''),
('Екатерина', 'Редкая', '902-233-2237', 'red@ya.ru'),
('Андрей', 'Сидоров', '911-765-9500', 'a-sidor@mail.ru'),
('Алексей', 'Иванов', '911-345-3457', '');

INSERT INTO public.order_status
(ost_name) values 
('Формирование заказа'),
('Выполнен'),
('Доставка Grab'),
('Доставка 7 eleven'),
('Самовывоз 7 eleven'),
('Самовывоз Tesco Lotus');

INSERT INTO public.order2
(prd_id, cst_id, ord_date, ord_quantity, ost_id) values
(1, 2, '2025-10-01 12:25:00', 3, 2),
(4, 1, '2025-10-01 14:24:00', 4, 2),
(1, 4, '2025-10-01 15:42:00', 2, 3),
(2, 5, '2025-10-01 16:22:00', 4, 4),
(3, 6, '2025-10-01 09:54:00', 3, 4),
(5, 7, '2025-10-01 11:01:00', 2, 5),
(1, 2, '2025-10-01 13:08:00', 8, 6),
(7, 7, CURRENT_TIMESTAMP, 2, 1);




